In [1]:
#DATA science internship class-1

In [ ]:
import pandas as pd
import numpy as np

In [21]:

num=np.array([34,102,45,10,20,30,40,85,25,63,74],dtype=np.float32)

In [22]:
num

array([ 34., 102.,  45.,  10.,  20.,  30.,  40.,  85.,  25.,  63.,  74.],
      dtype=float32)

In [23]:
type(num)

numpy.ndarray

In [24]:
num.dtype

dtype('float32')

In [25]:
num.size

11

In [26]:
num[5]

30.0

In [29]:
s=pd.Series([34,102,45,10,20,30,40,85,25,63])

In [30]:
s

0     34
1    102
2     45
3     10
4     20
5     30
6     40
7     85
8     25
9     63
dtype: int64

In [31]:
type(s)

pandas.core.series.Series

In [32]:
s.size

10

In [33]:
s[6]

40

In [43]:
r=pd.Series([1,2,3,4,5,6,7])
n=pd.Series(['hii','pie','kya','bol','chal'])
m=pd.Series([75.8,52.3,45.6,12.3,78.9,95.5])

In [44]:
df=pd.DataFrame({'roll':r,
                'name':n,
                'marks':m
                })

In [45]:
df

   roll  name  marks
0     1   hii   75.8
1     2   pie   52.3
2     3   kya   45.6
3     4   bol   12.3
4     5  chal   78.9
5     6   NaN   95.5
6     7   NaN    NaN

In [46]:
df.shape

(7, 3)

In [47]:
df.size

21

In [51]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [54]:
import os
os.getcwd()

'C:\\Users\\Chaitanya\\OneDrive\\Desktop\\classes'

In [55]:
df=pd.read_csv('student.csv')

In [56]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [60]:
cols=['A','B','C','D','F']

In [65]:
mf=pd.read_csv('student1.csv', names=cols)

In [66]:
mf

    A        B   C      D   F
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [71]:
df3=pd.read_csv('student3.tsv', sep="\t")
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [74]:
df4= pd.read_csv("https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv")
df4

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE